In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Al", "Bhosdu", "Babblu"], 
    "last": ["Singh", "Lullu", "Capone"],
    "email": ["as@gmal.com", "bl@email.com", "bs@email.com"]
}

In [3]:
sample_df = pd.DataFrame(people)

In [4]:
sample_df["first"] + " " + sample_df["last"]

0         Al Singh
1     Bhosdu Lullu
2    Babblu Capone
dtype: object

In [5]:
# Combining columns
sample_df["full_name"] = sample_df["first"] + " " + sample_df["last"]

In [6]:
sample_df

    first    last         email      full_name
0      Al   Singh   as@gmal.com       Al Singh
1  Bhosdu   Lullu  bl@email.com   Bhosdu Lullu
2  Babblu  Capone  bs@email.com  Babblu Capone

In [7]:
# Removing columns
sample_df.drop(columns=["first", "last"], inplace=True)

In [8]:
sample_df

          email      full_name
0   as@gmal.com       Al Singh
1  bl@email.com   Bhosdu Lullu
2  bs@email.com  Babblu Capone

In [9]:
sample_df["full_name"].str.split(" ")

0         [Al, Singh]
1     [Bhosdu, Lullu]
2    [Babblu, Capone]
Name: full_name, dtype: object

In [10]:
sample_df["full_name"].str.split(" ", expand=True)

        0       1
0      Al   Singh
1  Bhosdu   Lullu
2  Babblu  Capone

In [11]:
sample_df[["first", "last"]] = sample_df["full_name"].str.split(" ", expand=True)

In [12]:
sample_df

          email      full_name   first    last
0   as@gmal.com       Al Singh      Al   Singh
1  bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2  bs@email.com  Babblu Capone  Babblu  Capone

In [13]:
# Add single row
sample_df = pd.concat([sample_df, pd.DataFrame.from_records([{"first": "Chaman"}])], ignore_index=True)

In [14]:
sample_df

          email      full_name   first    last
0   as@gmal.com       Al Singh      Al   Singh
1  bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2  bs@email.com  Babblu Capone  Babblu  Capone
3           NaN            NaN  Chaman     NaN

In [15]:
p = {
    "first": ["Tony", "Bruce"],
    "last": ["Stark", "Wayne"],
    "email": ["IronMan@avenge.com", "Brucey@orphan.com"]
}

s_df = pd.DataFrame(p)

In [16]:
s_df

   first   last               email
0   Tony  Stark  IronMan@avenge.com
1  Bruce  Wayne   Brucey@orphan.com

In [19]:
pd.concat([sample_df, s_df])

                email      full_name   first    last
0         as@gmal.com       Al Singh      Al   Singh
1        bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2        bs@email.com  Babblu Capone  Babblu  Capone
3                 NaN            NaN  Chaman     NaN
0  IronMan@avenge.com            NaN    Tony   Stark
1   Brucey@orphan.com            NaN   Bruce   Wayne

In [20]:
sample_df

          email      full_name   first    last
0   as@gmal.com       Al Singh      Al   Singh
1  bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2  bs@email.com  Babblu Capone  Babblu  Capone
3           NaN            NaN  Chaman     NaN

In [23]:
sample_df = pd.concat([sample_df, s_df], ignore_index=True)

In [24]:
sample_df

                email      full_name   first    last
0         as@gmal.com       Al Singh      Al   Singh
1        bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2        bs@email.com  Babblu Capone  Babblu  Capone
3                 NaN            NaN  Chaman     NaN
4  IronMan@avenge.com            NaN    Tony   Stark
5   Brucey@orphan.com            NaN   Bruce   Wayne
6  IronMan@avenge.com            NaN    Tony   Stark
7   Brucey@orphan.com            NaN   Bruce   Wayne

In [25]:
# Removing rows
sample_df.drop(index=3, inplace=True)

In [26]:
sample_df

                email      full_name   first    last
0         as@gmal.com       Al Singh      Al   Singh
1        bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2        bs@email.com  Babblu Capone  Babblu  Capone
4  IronMan@avenge.com            NaN    Tony   Stark
5   Brucey@orphan.com            NaN   Bruce   Wayne
6  IronMan@avenge.com            NaN    Tony   Stark
7   Brucey@orphan.com            NaN   Bruce   Wayne

In [31]:
filt_stark = sample_df["last"] == "Stark"
sample_df.drop(index=sample_df[filt_stark].index, inplace=True)

In [32]:
sample_df

               email      full_name   first    last
0        as@gmal.com       Al Singh      Al   Singh
1       bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2       bs@email.com  Babblu Capone  Babblu  Capone
5  Brucey@orphan.com            NaN   Bruce   Wayne
7  Brucey@orphan.com            NaN   Bruce   Wayne